# Toposolid Create Sub Division Method

Source: https://www.revitapidocs.com/2026/913cefb0-62c2-062b-9ced-89f885601edf.htm

---

| Toposolid Create Sub Division Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateSubDivision(Document, IList CurveLoop ) |  |
|  | CreateSubDivision(Document, ElementId, IList CurveLoop ) |  |

Top See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace